In [1]:
###Import Modules agar mengetahui version pandas dan numpy yang digunakan
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [7]:
####Pertama kita akan membentuk data frame terlebih dahulu
n_rows = 5
n_cols = 2
cols = ['bil_pecahan', 'bil_bulat']

####Membuat Objek Data Frame
df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
#####Mengconversi tipe data pecahan menjadi float
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

####Membuat index
df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()

####Menambah kolom teks
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          6.0          8    A
1 2000-01-01 01:00:00          5.0         11    B
2 2000-01-01 02:00:00         18.0          8    C
3 2000-01-01 03:00:00          4.0          4    D
4 2000-01-01 04:00:00         17.0          5    E

In [8]:
####Untuk memverifikasi tipe datanya
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [9]:
###Memilih kolom bertipe data numerik saja
df.select_dtypes(include='number')
####Berfungsi untuk memilih data yang numerik saja

   bil_pecahan  bil_bulat
0          6.0          8
1          5.0         11
2         18.0          8
3          4.0          4
4         17.0          5

In [10]:
####Jika Memlih data yang bertipe float maka parameter includenya diubah menjadi float
df.select_dtypes(include='float')

   bil_pecahan
0          6.0
1          5.0
2         18.0
3          4.0
4         17.0

In [11]:
####Jika Memlih data yang bertipe integer maka parameter includenya diubah menjadi integer
df.select_dtypes(include='int')

   bil_bulat
0          8
1         11
2          8
3          4
4          5

In [12]:
####Memilih kolom bertipe String saja
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [13]:
####Memilih kolom bertipe data datetime saja
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [14]:
####Membuat kolom dengan kombinasi data
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          6.0          8    A
1          5.0         11    B
2         18.0          8    C
3          4.0          4    D
4         17.0          5    E